Repository: CherokeeLanguage/Action-Imitation-and-Fun-Series
Catalog: 02-The-Little-Red-Hen/CAT/red-hen/tm/three-kittens.en.utf8.tmx
Source language: en
Languages: chr

source: a kitten
chr: ᏪᏌ ᎠᏓ

source: the kitten
chr: ᏪᏌ ᎠᏓ

source: one kitten
chr: ᏌᏊ ᏪᏌ ᎠᏓ

source: two kittens
chr: ᎠᏂᏔᎵ ᏪᏌ ᎠᏂᏓ

source: three kittens
chr: ᎠᏂᏦᎢ ᏪᏌ ᎠᏂᏓ

source: See the kittens.
chr: ᏪᏌ ᎠᏂᏓ ᏘᎪᏩᏔ.

source: They are good kittens.
chr: ᎠᏃᏍᏓ ᏪᏌ ᎠᏂᏓ.

source: One, two kittens.
chr: ᏌᏊ, ᎠᏂᏔᎵ ᏪᏌ ᎠᏂᏓ.

source: One, two, three kittens.
chr: ᏌᏊ, ᎠᏂᏔᎵ, ᎠᏂᏦᎢ ᏪᏌ ᎠᏂᏓ.

source: How do you do, kittens?
chr: ᎣᏏᏊᏍ, ᎢᏥᏪᏌ ᎢᏥᏓ?

source: Can you talk with us?
chr: ᎡᎵᏊᏍ ᏱᏂᏕᏍᎩᏫᏏ?

source: O, yes, we can talk.
chr: Ꭳ, ᎥᎥ, ᎡᎵᏊ ᏱᏂᏕᏨᏫᏏ.

source: Mew, mew, mew!
chr: ᎻᏳ, ᎻᏳ, ᎻᏳ!

source: Did you hear us?
chr: ᏕᏍᎩᏯᏛᎬᎦᏍ?

source: We said, "Mew, mew, mew!"
chr: "ᎻᏳ, ᎻᏳ, ᎻᏳ!" ᏕᏨᏪᎵ.

source: Mew, mew!
chr: ᎻᏳ, ᎻᏳ!

source: How do you do?
chr: ᎣᏏᏊᏍ?

source: Can you talk, little girl?
chr: ᎡᎵᏊᏍ ᏱᏂᏫ, ᎤᏍᏗ ᎠᎨᏳᏣ?

source: Can you talk, little boy?
chr: ᎡᎵᏊᏍ ᏱᏂᏫ, ᎤᏍᏗ ᎠᏧᏣ?

source: Can you say mew, mew, mew?
chr: ᎡᎵᏊᏍ ᎯᎠ ᏱᏂᏫ, "ᎻᏳ, ᎻᏳ, ᎻᏳ"?

source: a mitten
chr: ᎠᎵᏰᏑᎶ

source: the mitten
chr: ᎠᎵᏰᏑᎶ

source: mittens
chr: ᏗᎵᏰᏑᎶ

source: the mittens
chr: ᏗᎵᏰᏑᎶ

source: See, little boy.
chr: Ꮒ, ᎤᏍᏗ ᎠᏧᏣ.

source: See, little girl.
chr: Ꮒ, ᎤᏍᏗ ᎠᎨᏳᏣ.

source: We have mittens.
chr: ᏗᎵᏰᏑᎶ ᏙᎩᎾᎠ.

source: Have you a mitten, too?
chr: ᎠᎵᏰᏑᎶᏍ ᎥᏍᏊ ᏣᎾᎠ?

source: Have you mittens, too?
chr: ᏗᎵᏰᏑᎶᏍ ᎥᏍᏊ ᏕᏣᎾᎠ?

source: Have you mittens, little boy?
chr: ᏗᎵᏰᏑᎶᏍ ᏕᏣᎾᎠ, ᎤᏍᏗ ᎠᏧᏣ?

source: Have you mittens, little girl?
chr: ᏗᎵᏰᏑᎶᏍ ᏕᏣᎾᎠ, ᎤᏍᏗ ᎠᎨᏳᏣ?

source: We like our mittens.
chr: ᏦᎦᏤᎵ ᏗᎵᏰᏑᎶ ᏙᎩᎸᏉᏗ.

source: Do you like our mittens?
chr: ᏗᏥᎸᏉᏗᏍ, ᏦᎦᏤᎵ ᏗᎵᏰᏑᎶ?

source: Let us see your mittens, little girl.
chr: ᏗᏣᏤᎵ ᏗᎵᏰᏑᎶ ᎢᏍᎩᎪᏩᏛᏓ, ᎤᏍᏗ ᎠᎨᏳᏣ.

source: Let ns see your mittens, little boy.
chr: ᏗᏣᏤᎵ ᏗᎵᏰᏑᎶ ᎢᏍᎩᎪᏩᏛᏓ, ᎤᏍᏗ ᎠᏧᏣ.

source: We like your mittens, too.
chr: ᏗᏣᏤᎵ ᏗᎵᏰᏑᎶ ᎥᏍᏊ ᏙᎩᎸᏉᏗ.

source: Our mittens are silk.
chr: ᏦᎦᏤᎵ ᏗᎵᏰᏑᎶ ᏏᎵᎩ ᎬᏗ ᎨᎪᏢᏅᎢ.

source: Are your mittens silk?
chr: ᏗᏣᏤᎵᏍ ᏗᎵᏰᏑᎶ ᏏᎵᎩ ᎬᏗ ᎨᎪᏢᏅᎢ?

source: Our mittens are white.
chr: ᏦᎦᏤᎵ ᏗᎵᏰᏑᎶ ᏧᏁᎦ.

source: Are your mittens white?
chr: ᏧᏁᎦᏍ ᏗᏣᏤᎵ ᏗᎵᏰᏑᎶ?

source: Our mittens are white silk.
chr: ᏦᎦᏤᎵ ᏗᎵᏰᏑᎶ ᏧᏁᎦ ᏏᎵᎩ.

source: Are your mittens white silk?
chr: ᏧᏁᎦᏍ ᏏᎵᎩ ᏗᏣᏤᎵ ᏗᎵᏰᏑᎶ?

source: We like our silk mittens.
chr: ᏦᎦᏤᎵ ᏏᎵᎩ ᏗᎵᏰᏑᎶ ᏙᎩᎸᏉᏗ.

source: Our mittens are clean.
chr: ᏦᎦᏤᎵ ᏗᎵᏰᏑᎶ ᏧᏓᏅᎦᎸᏓ.

source: We try to keep them clean.
chr: ᎥᏍᎩᎾ ᏧᏓᏅᎦᎸᏓ ᎨᏒ ᎣᏣᏁᏟᏗᏍᎪ.

source: Are your mittens clean?
chr: ᏧᎾᏅᎦᎸᏓᏍ ᏗᏣᏤᎵ ᏗᎵᏰᏑᎶ?

source: Do you keep them clean?
chr: ᎢᏣᏁᏟᏗᏍᎪᏍ ᎥᏍᎩᎾ ᏧᎾᏅᎦᎸᏓ ᎨᏒ?

source: See how clean our mittens are!
chr: Ꮒ ᏦᎦᏤᎵ ᏗᎵᏰᏑᎶ ᏙᏳᎯ ᏧᏓᏅᎦᎸᏓ!

source: The clean, white mittens!
chr: ᏧᎾᏅᎦᎸᏓ ᏧᏁᎦ ᏗᎵᏰᏑᎶ!

source: The clean, white, silk mittens!
chr: ᏧᎾᏅᎦᎸᏓ ᏧᏁᎦ ᏏᎵᎩ ᏗᎵᏰᏑᎶ!

source: They are clean mittens.
chr: ᏗᎵᏰᏑᎶ ᏧᏓᏅᎦᎸᏓ.

source: We are clean kittens, too.
chr: ᎠᏴ ᎥᏍᏊ ᏧᎾᏓᏅᎦᎸᏓ ᏪᏌ ᎠᏂᏓ.

source: We like to keep our mittens clean.
chr: ᏦᎦᏤᎵ ᏗᎵᏰᏑᎶ ᏚᏓᏅᎦᎸᏓ ᏙᎩᎸᏉᏗ.

source: Hear what I say, little kittens.
chr: ᎠᏆᏛᏅᎢ ᎢᏣᏛᎬᎦ, ᏧᎾᏍᏗ ᏪᏌ ᎠᏂᏓ.

source: Try not to soil your mittens.
chr: ᏗᏣᏤᎵ ᏗᎵᏰᏑᎶ ᏗᎦᏓᎭ ᏄᎾᎵᏍᏓᏁᎸᎾ ᎢᏣᏁᏟᏔᏅᎭ.

source: "We will try," said the kittens.
chr: “ᏓᏲᏣᏁᏟᏔᏂ,” ᏄᏂᏪᏒ ᏪᏌ ᎠᏂᏓ.

source: "We will try to keep them clean.
chr: “ᎥᏍᎩᎾ ᏧᏓᏅᎦᎸᏓ ᎨᏎᏍᏗ ᏓᏲᏣᏁᏟᏔᏂ”

source: Do you soil your mittens, little boy?
chr: ᎤᎾᎵᏍᏓᏁᎰᏍ ᏗᏣᏤᎵ ᏗᎵᏰᏑᎶ ᏗᎦᏓᎭ, ᎤᏍᏗ ᎠᏧᏣ?

source: Do you soil your mittens, little girl?
chr: ᎤᎾᎵᏍᏓᏁᎰᏍ ᏗᏣᏤᎵ ᏗᎵᏰᏑᎶ ᏗᎦᏓᎭ, ᎤᏍᏗ ᎠᎨᏳᏣ?

source: We try to keep our mittens clean.
chr: ᎪᏣᏤᎵ ᏗᎵᏰᏑᎶ ᏧᏓᏅᎦᎸᏓ ᎨᏎᏍᏗ ᎣᏣᏁᏟᏗᏍᎪ.

source: Do we wash our mittens?
chr: ᏙᏨᎩᎶᏍᎪᏍ ᏦᎦᏤᎵ ᏗᎵᏰᏑᎶ?

source: Yes, if we soil them.
chr: ᎥᎥ, ᏗᎦᏓᎭ ᎬᏓᏳᎾᎵᏍᏓᏁᎵ.

source: We shall wash them now.
chr: ᏃᏊ ᏙᏓᏲᏨᎩᎶᎢ.

source: We shall wash them clean.
chr: ᎥᏍᎩᎾ ᏧᏓᏅᎦᎸᏓ ᏙᏓᏲᏨᎩᎶᎢ.

source: We shall wash them in the tub."
chr: ᏒᏙᏂᎯ ᏙᏓᏲᏨᎩᎶᎢ.

source: Can the kittens wash?
chr: ᏗᎬᏩᏅᎩᎶᏍᏗᏍ ᏪᏌ ᎠᏂᏓ?

source: O, yes, they can wash.
chr: Ꭳ, ᎥᎥ, ᏗᎬᏩᏅᎩᎶᏍᏗ.

source: They can wash their mittens.
chr: ᏦᎦᏤᎵ ᏗᎵᏰᏑᎶ ᏗᎬᏩᏅᎩᎶᏍᏗ.

source: They will put them in the tub.
chr: ᏒᏙᏂᎯ ᏛᏂᎸᏂ.

source: They will soap the mittens.
chr: ᏗᎵᏰᏑᎶᎯ ᎣᏝ ᎠᏂᏝᎲᏍᎨᏍᏗ.

source: Then they will rub, rub, rub!
chr: ᎾᎯᏳ ᏙᏛᎾᏍᎪᎵᏰᎢᎶᎢ!

source: They will put soap on the mittens.
chr: ᏗᎵᏰᏑᎶᎯ ᎣᏝ ᎠᏂᏝᎲᏍᎨᏍᏗ.

source: Then they will boil the mittens.
chr: ᎾᎯᏳ ᏗᎵᏰᏑᎶ ᏙᏛᎾᎵᏢᏓᏂ.

source: See how white the mittens are.
chr: Ꮒ, ᏗᎵᏰᏑᎶ ᎤᏟᎧ ᏧᏁᎦ.

source: They are white and clean.
chr: ᎥᏍᎩᎾ ᏧᏁᎦ ᎠᎴ ᏧᏓᏅᎦᎸᏓ.

source: Rub, rub, rub!
chr: ᎨᎦᏍᎪᎵᏰᎢᎶᎥᎢ!

source: Now the mittens are clean.
chr: ᏃᏊ ᏗᎵᏰᏑᎶ ᏧᏓᏅᎦᎸᏓ.

source: Boil, boil, boil!
chr: ᎨᎦᎵᏢᎯᎶᎥᎢ!

source: Now the mittens are white.
chr: ᏃᏊ ᏗᎵᏰᏑᎶ ᏧᏁᎦ.

source: What will the kittens do now?
chr: ᎦᏙ ᏃᏊ ᏛᎾᏛᏁᎵ ᏪᏌ ᎠᏂᏓ?

source: They will dry the mittens.
chr: ᏗᎵᏰᏑᎶ ᏙᏛᏂᎧᏲᏔᏂ.

source: They will hang them up.
chr: ᏙᏛᎾᏛᏂ.

source: They will hang them up to dry.
chr: ᎤᏂᎧᏲᎯᏍᏗ ᏙᏛᎾᏛᏂ.

source: They will hang them out in the sun.
chr: ᎠᎦᎵᏍᎬ ᏙᏛᎾᏛᏂ.

source: See, the mittens are on the line.
chr: Ꮒ, ᏗᎵᏰᏑᎶ ᏍᏕᏱᏓ ᎠᎾᏓᎠ.

source: Now they will dry.
chr: ᏃᏊ ᏛᏂᎧᏲᏏ.

source: They will hang in the sun.
chr: ᎠᎦᎵᏍᎬ ᎠᎾᏓᎡᏍᏗ.

source: They will hang on the line.
chr: ᏍᏕᏱᏓᎢ ᎠᎾᏓᎡᏍᏗ.

source: They will dry in the sun.
chr: ᎠᎦᎵᏍᎬ ᏛᏂᎧᏲᏏ.

source: They will dry on the line.
chr: ᏍᏕᏱᏓᎢ ᏛᏂᎧᏲᏏ.

source: Here is a magpie.
chr: ᎠᏂ ᏩᏘᏰᎵ.

source: The magpie is a bird.
chr: ᏩᏘᏰᎵ ᏥᏍᏆ.

source: The magpie can talk.
chr: ᏩᏘᏰᎵ ᎡᎵᏊ ᏱᎦᏬᏂᎭ.

source: The magpie can steal.
chr: ᏩᏘᏰᎵ ᎡᎵᏊ ᏱᎦᏃᏍᎦ.

source: The magpie likes to talk.
chr: ᏩᏘᏰᎵ ᎤᏬᏂᎯᏍᏗ ᎤᎸᏉᏗ.

source: The magpie likes to steal.
chr: ᏩᏘᏰᎵ ᎤᏃᏍᎩᏍᏗ ᎤᎸᏉᏗ.

source: The magpie saw the kittens.
chr: ᏩᏘᏰᎵ ᏪᏌ ᎠᏂᏓ ᏚᎪᎮ.

source: The magpie saw the mittens.
chr: ᏩᏘᏰᎵ ᏗᎵᏰᏑᎶ ᏚᎪᎮ.

source: "I will have some fun," he said.
chr: “ᏓᏥᏪᏢᏂ,” ᎤᏛᏁ.

source: "O, I will have some fun.
chr: “Ꭳ, ᏓᏥᏪᏢᏂ.

source: Ha, ha!
chr: Ꭾ, Ꭾ!

source: I will steal the mittens.
chr: ᏗᎵᏰᏑᎶ ᏙᏓᏥᏃᏍᎩᏏ.

source: I will hide them.
chr: ᏙᏓᎬᏍᎦᎸᏂ.

source: How can I get them ?
chr: ᏗᎩᏁᏍᏗ ᎦᏙ ᏓᎦᏛᏁᎵ?

source: I will talk to the kittens.
chr: ᏪᏌ ᎠᏂᏓ ᏂᏓᎦᏥᏪᏎᎵ.

source: Hear me talk to them.
chr: ᏍᏆᏛᎬᎦ ᏂᎦᏥᏪᏒᎢ.

source: Then I will get the mittens."
chr: ᎾᎯᏳ ᏗᎵᏰᏑᎶ ᏙᏓᏥᏁᏏ.”

source: "How do you do, kittens?"
chr: “ᎣᏏᏊᏧ ᎢᏥᏪᏌ ᎢᏥᏓ?”

source: "O, how do you do, magpie?
chr: “Ꭳ, ᎣᏏ, ᏂᎯᎾ, ᏩᏘᏰᎵ?”

source: Do you see our white mittens?"
chr: ᏕᎯᎪᏩᏘᎭᏍ ᏦᎦᏤᎵ ᏧᏁᎦ ᏗᎵᏰᏑᎶ?”

source: "Yes, I see them," said the magpie.
chr: “ᎥᎥ, ᏕᏥᎪᏩᏘᎭ,” ᎤᏛᏁ ᏩᏘᏰᎵ.

source: "They are clean white mittens.
chr: “ᏧᏓᏅᎦᎸᏓ ᎠᎴ ᏧᏁᎦ, Ꮎ ᏗᎵᏰᏑᎶ.

source: I saw you wash them.
chr: ᏕᏨᎩᎶᏍᎬ ᏥᎪᏩᏔ.

source: I saw you hang them on the line.
chr: ᏍᏕᏱᏓᎢ ᏕᏣᏛᎥᏍᎬ ᏥᎪᏩᏔ.

source: Are they silk mittens?"
chr: ᏏᎵᎩ ᎬᏗ ᎨᎪᏢᏁ?

source: "Yes, they are silk."
chr: ᎥᎥ, ᏏᎵᎩ.

source: The magpie laughed.
chr: ᏩᏘᏰᎵ ᎤᏰᏘᏎ.

source: "Why do you laugh?" said the kittens.
chr: “ᎦᏙᎲ ᏣᏰᏘᏍᎦ?” ᏄᏂᏪᏎ ᏪᏌ ᎠᏂᏓ.

source: O, just for fun," said the magpie.
chr: “Ꭳ, ᎦᎵᎡᎵᎦᏊ," ᏄᏪᏎ ᏩᏘᏰᎵ.

source: "Ha, ha, ha!"
chr: “Ꭾ, Ꭾ, Ꭾ!”

source: Then the magpie flew away.
chr: ᎾᎯᏳ ᏩᏘᏰᎵ ᎤᏝᏫᏛᎮᎢ.

source: "What a strange bird!" said the kittens.
chr: “ᏥᏍᏆ ᎤᏬᎵᏗ!” ᏄᏂᏪᏎ ᏪᏌ ᎠᏂᏓ.

source: "What a strange magpie!"
chr: “ᏩᏘᏰᎵ ᎤᏬᎵᏗ!”

source: Keep away from the magpie, kittens.
chr: ᏩᏘᏰᎵ ᎾᎥ, ᏞᏍᏗ ᏥᏤᎾ.

source: He is a bad bird.
chr: ᏥᏍᏆ ᎤᏲᎢ.

source: He likes to steal mittens.
chr: ᏗᎵᏰᏑᎶ ᏧᏃᏍᎩᏍᏗ ᎤᎸᏉᏗ.

source: He likes to hide mittens.
chr: ᏗᎵᏰᏑᎶ ᏧᏩᏍᎦᎸᏗ ᎤᎸᏉᏗ.

source: So the magpie stole the mittens.
chr: Ꮓ, ᏩᏘᏰᎵ ᏗᎵᏰᏑᎶ ᏚᏃᏍᎩᏎ.

source: What will he do with them?
chr: ᎦᏙ ᎥᏍᎩᎾ ᎬᏗ ᏙᏛᏛᏁᎵ?

source: He will hide the mittens.
chr: ᏗᎵᏰᏑᎶ ᏙᏓᎬᏍᎦᎸᏂ.

source: He flew to the roof.
chr: ᎦᏌᎾᎵ ᏗᏜ ᎤᏝᏫᏛᎮ.

source: See where he has put them.
chr: Ꮒ, ᎤᎿ ᏚᏁ.

source: He has put them on the roof.
chr: ᎦᏌᎾᎵᎢ ᏚᏁ.

source: The kittens will not see them.
chr: Ꮭ ᏙᏛᏂᎪᎯ, Ꮎ ᏪᏌ ᎠᏂᏓ.

source: The kittens can not find them.
chr: Ꮭ ᏴᎬᏂᏩᏔ, Ꮎ ᏪᏌ ᎠᏂᏓ.

source: See the three kittens.
chr: ᎠᏂᏦᎢ ᏪᏌ ᎠᏂᏓ ᏘᎪᏩᏔ.

source: O, where are our mittens?
chr: Ꭳ, ᎭᏢ ᏦᎦᏤᎵ ᏗᎵᏰᏑᎶ?

source: Are they on the line?
chr: ᏍᏕᏱᏓᎢᏍ ᎠᎾᏓᎠ?

source: Are they in the tub?
chr: ᏒᏙᏂᏍ ᎤᎾᏣᎠ?

source: O, no, no!
chr: Ꭳ, Ꮭ, ᎥᏝ!

source: O, mother, mother!
chr: Ꭳ, ᎡᏥ, ᎡᏥ!

source: We have lost our mittens !
chr: ᏦᎦᏤᎵ ᏗᎵᏰᏑᎶ ᎣᎩᏲᎱᏏ!

source: O! O! O!
chr: Ꭳ! Ꭳ! Ꭳ!

source: What, lost your mittens?
chr: ᎦᏙ? ᏗᏣᏤᎵ ᏗᎵᏰᏑᎶ ᏕᏥᏲᎱᏏ?

source: O, you little kittens!
chr: Ꭳ, ᏂᎯ ᎢᏣᏍᏗ ᎢᏥᏪᏌ ᎢᏥᏓ!

source: The kittens began to cry.
chr: ᏪᏌ ᎠᏂᏓ ᎠᎾᏠᏱᎮ ᎤᎾᎴᏅᎮ.

source: O, we have lost our mittens!
chr: Ꭳ, ᏦᎦᏤᎵ ᏗᎵᏰᏑᎶ ᏙᎩᏲᎱᏏ!

source: O, you naughty kittens!
chr: Ꭳ, ᎢᏥᏲᎢ ᎢᏥᏪᏌ ᎢᏥᏓ!

source: You naughty, naughty kittens!
chr: ᏂᎯ ᎢᏥᏲᎢ ᎢᏥᏪᏌ ᎢᏥᏓ!

source: Have you lost your mittens?
chr: ᏕᏥᏲᎱᏏᏍ ᏗᏣᏤᎵ ᏗᎵᏰᏑᎶ?

source: You naughty kittens.
chr: ᎢᏥᏲᎢ ᎢᏥᏪᏌ ᎢᏥᏓ.

source: Yes, we have lost our mittens.
chr: ᎥᎥ, ᏦᎦᏤᎵ ᏗᎵᏰᏑᎶ ᏙᎩᏲᎱᏏ.

source: Are they not in the tub?
chr: ᏒᏙᏂᎯᏧ ᎤᎿ?

source: I saw you hang them out to dry.
chr: ᎤᏂᎧᏲᎯᏍᏗ ᏕᏣᏛᏅ ᎠᎩᎪᎲ.

source: Are they not on the line?
chr: ᏍᏕᏱᏓᎢᏧ ᎤᎿ?

source: I saw you rub them,
chr: ᏕᏣᏍᎪᎵᏰᎢᎶᎥ ᎠᎩᎪᎲ.

source: I saw you soap them.
chr: ᏗᎵᏰᏑᎶᎯ ᎣᏝ ᏕᏥᏝᎲᏅ ᎠᎩᎪᎲ.

source: I saw you boil them.
chr: ᏚᎾᎵᏢᏓᏅ ᎠᎩᎪᎲ.

source: Where are they now?
chr: ᎭᏢ ᎥᏍᎩᎾ?

source: We do not know.
chr: Ꮭ ᏲᎦᏅᏔ.

source: We have lost our mittens!
chr: ᏦᎦᏤᎵ ᏗᎵᏰᏑᎶ ᏙᎩᏲᎱᏏ!

source: Our white, silk mittens!
chr: ᏦᎦᏤᎵ ᏧᏁᎦ ᏏᎵᎩ ᏗᎵᏰᏑᎶ!

source: Our clean, white mittens!
chr: ᏦᎦᏤᎵ ᏧᏓᏅᎦᎸᏓ ᏧᏁᎦ ᏗᎵᏰᏑᎶ!

source: You should take care of your mittens.
chr: ᏗᏣᏤᎵ ᏗᎵᏰᏑᎶ ᏕᏣᎵᏏᏅᏔᏅᎭ.

source: You should keep them clean.
chr: ᎥᏍᎩᎾ ᏗᎦᏓᎭ ᏄᎾᎵᏍᏔᏅᎾ ᎢᏣᏛᏁᎸᎭ.

source: You should not lose them.
chr: ᏞᏍᏗ ᏥᏙᏥᏲᎱᏏ.

source: You are naughty kittens.
chr: ᏂᎯ ᎢᏥᏲ ᎢᏥᏪᏌ ᎢᏥᏓ.

source: I do not like naughty kittens.
chr: ᎤᏂᏲ ᏪᏌ ᎠᏂᏓ Ꮭ ᏯᎩᎸᏉᏙ.

source: You shall have no pie.
chr: ᎨᎵᏍᏘᎩ ᎥᏝ ᏱᏓᏥᎯ.

source: We like pie.
chr: ᏗᎨᎵᏍᏘᎩ ᏙᏥᎸᏉᏙ.

source: Can we have no pie?
chr: ᏝᏍᎪ ᎨᎵᏍᏘᎩ ᏱᏓᏥᎯ?

source: O, mother, mother, mother!
chr: Ꭳ, ᎡᏥ, ᎡᏥ, ᎡᏥ!

source: The naughty magpie stole the mittens.
chr: Ꮎ ᎤᏲᎢ ᏩᏘᏰᎵ ᏗᎵᏰᏑᎶ ᏚᏃᏍᎩᏒ.

source: He flew up to the roof.
chr: ᎦᏌᎾᎵ ᏗᏜ ᎤᏝᏫᏛᎲ.

source: He likes to steal.
chr: ᎤᏃᏍᎩᏍᏗ ᎤᎸᏉᏗ.

source: He likes to hide.
chr: ᎤᏩᏍᎦᎸᏗ ᎤᎸᏉᏗ.

source: Three little kittens,
chr: ᎠᏂᏦᎢ ᎤᏍᏗ ᏪᏌ ᎠᏂᏓ,

source: They lost their mittens,
chr: ᏧᎾᏤᎵ ᏗᎵᏰᏑᎶ ᎤᏂᏲᎱᏎᎴ,

source: And they began to cry.
chr: ᎠᎴ ᎠᎾᏠᏱᎮ ᎠᎾᎴᏅᎮ.

source: O, mother dear, we greatly fear,
chr: Ꭳ, ᎡᏥ ᎡᏥ, ᎡᏆ ᎣᏥᏍᎦᎭ,

source: Our mittens we have lost.
chr: ᏦᎦᏤᎵ ᏗᎵᏰᏑᎶ ᏙᎩᏲᎱᏏ.

source: What, lost your mittens!
chr: ᎦᏙ, ᏗᏣᏤᎵ ᏗᎵᏰᏑᎶ ᏕᏥᏲᎱᏏ!

source: You naughty kittens!
chr: ᏂᎯ ᎢᏥᏲᎢ ᎢᏥᏪᏌ ᎢᏥᏓ!

source: Then you shall have no pie.
chr: ᎾᎯᏳ ᎨᎵᏍᏘᎩ Ꮭ ᏱᏙᏓᏥᎯ.

source: Let us hunt for our mittens.
chr: ᏦᎦᏤᎵ ᏗᎵᏰᏑᎶ ᏙᏥᏯᎷᎦ.

source: "Yes," said the kittens.
chr: “ᎥᎥ,” ᏄᏂᏪᏎ ᏪᏌ ᎠᏂᏓ.

source: "We will hunt for them.
chr: “ᏙᎩᏯᎸᏏ.

source: Where shall we hunt?
chr: ᎭᏢ ᎤᎿ ᏧᏂᏯᎸᏍᏗ?”

source: Where shall we look for them?
chr: ᎭᏢ ᎤᎿ ᏧᏂᏯᎸᏍᏗ?

source: Shall we look in the tub?
chr: ᏒᏙᏂᏍ ᎣᎩᏯᎸᏒᎭ?

source: Shall we look on the line?"
chr: ᏍᏕᏱᏓᏍ ᎣᎩᏯᎸᏒᎭ?

source: No, they are not in the tub.
chr: ᎥᏝ, ᎥᏍᎩᎾ ᏒᏙᏂᎯ ᏱᎩ.

source: They are not on the line.
chr: ᎥᏝ, ᎥᏍᎩᎾ ᏍᏕᏱᏓᎢ ᏯᎾᏓᎠ.

source: O, where can they be?
chr: Ꭳ, ᎭᏢ ᎾᎿ ᏱᎩ?

source: Where shall we hunt for them?
chr: ᎭᏢ ᎤᎿ ᏧᏂᏯᎸᏍᏗ?

source: See the magpie!
chr: Ꮒ, ᎤᎿ ᏩᏘᏰᎵ!

source: See him laugh!
chr: Ꮒ, ᎤᏰᏘᏍᎦ!

source: He knows where the mittens are.
chr: ᎾᎿ ᏗᎵᏰᏑᎶ ᎤᏅᏔ.

source: He knows!
chr: ᎤᏅᏔ!

source: We must find our mittens.
chr: ᏦᎦᏤᎵ ᏗᎵᏰᏑᎶ ᎠᏎ ᏧᏂᏩᏛᏗ.

source: Shall we find them in the tub?
chr: ᏒᏙᏂᎯᏍ ᏙᏓᏲᏥᏩᏛᎯ?

source: No, we shall not find them there.
chr: ᎥᏝ ᎾᎿ ᏱᏙᏓᏲᏥᏩᏛᎯ.

source: They are not in the tub.
chr: ᎥᏝ ᏒᏙᏂᎯ ᏱᎩ.

source: Shall we find them on the line?
chr: ᏍᏕᏱᏓᎢᏍ ᏙᏓᏲᏥᏩᏛᎯ?

source: No, we shall not find them on the line.
chr: ᎥᏝ ᏍᏕᏱᏓᎢ ᏱᏙᏓᏲᏥᏩᏛᎯ.

source: Where, where are they?
chr: ᎭᏢ? ᎭᏢ? ᎭᏢ?

source: Let us look on this chair.
chr: ᎯᎠ ᎦᏍᎩᎶᎢ ᏙᏥᏯᎷᎦ.

source: No, they are not here.
chr: ᎥᏍᎩᎾ ᎥᏝ ᎠᎭᏂ ᏱᎩ.

source: Let us look on that chair.
chr: Ꮎ ᎦᏍᎩᎶᎢ ᏙᏥᏯᎷᎦ.

source: No, they are not there.
chr: ᎥᏍᎩᎾ ᎥᏝ ᎾᎿ ᏱᎩ.

source: Let us look on the stairs.
chr: Ꮎ ᎠᎩᏠᏒᏍᏗᎢ ᏙᏥᏯᎷᎦ.

source: No, they are not on the stairs.
chr: ᎠᎩᏠᏒᏍᏗᎢ ᎥᏝ ᎾᎿ ᏱᎩ.

source: O where are our mittens?
chr: Ꭳ, ᎭᏢ ᏦᎦᏤᎵ ᏗᎵᏰᏑᎶ?

source: They are not on the chairs.
chr: ᏗᎦᏍᎩᎶᎢ ᎥᏝ ᎾᎿ ᏱᎩ.

source: They are not on the stairs.
chr: ᎠᎩᏠᏒᏍᏗᎢ ᎥᏝ ᎾᎿ ᏱᎩ.

source: See, here is a box.
chr: Ꮒ, ᎠᎭᏂ ᎧᏁᏌᎢ.

source: Are the mittens in the box?
chr: ᏧᎸᏗᏍ ᎧᏁᏌᎢ?

source: Did you put them in the box?
chr: ᏕᏥᎸᏁᏍ ᎧᏁᏌᎢ?

source: No, we did not put them in the box.
chr: ᎥᏝ ᎥᏍᎩᎾ ᏱᏙᎩᎸᏅ.

source: Then how could they get into the box?
chr: ᎦᏙ ᎤᏛᏁᎴ Ꮎ ᎠᎾᎵᏍᏓᏁᎸᎢ ᎧᏁᏌᎢ?

source: It will do no harm to look.
chr: ᎤᏲᎢ ᏂᎨᏒᎾ ᏦᎩᏯᎸᏍᏗ.

source: They may be in the box.
chr: ᎥᏍᎩᎾ ᎡᎵᏊ ᎧᏁᏌᎢ.

source: Here is the table.
chr: ᎠᎭᏂ ᎦᏍᎩᎶ.

source: Are the mittens on the table ?
chr: ᎦᏍᎩᎶᎢᏍ ᏗᎵᏰᏑᎶ?

source: Did you put them on the table?
chr: ᏕᏥᏅᏍ ᎦᏍᎩᎶᎢ?

source: No, we did not put them on the table.
chr: ᎥᏝ, ᏱᏙᎩᏅ ᎦᏍᎩᎶ.

source: But we will look for them.
chr: ᎠᏎᏃ ᏙᏓᏥᏯᎵ.

source: Here is a bag.
chr: ᎠᎭᏂ ᏕᎦᎵᏗ.

source: Are the mittens in the bag?
chr: ᏕᎦᎵᏗᎯᏍ ᏗᎵᏰᏑᎶ?

source: Let us look into the bag.
chr: ᏕᎦᎵᏗᎯ ᏦᏥᏲᎦ.

source: No, the mittens are not there.
chr: ᏗᎵᏰᏑᎶ ᎥᏝ ᎾᎿ ᏱᎩ.

source: Here is a shelf.
chr: ᎠᎭᏂ ᎤᏯᏓᎾᎸᎢ.

source: Are the mittens on the shelf?
chr: ᎤᎾᎩᎳᏍ ᎠᏯᏔᎾᎸ?

source: O, no, little kittens.
chr: Ꭳ, ᎥᏝ, ᎢᏣᏍᏗ ᎢᏥᏪᏌ ᎢᏥᏓ.

source: How could they get upon the shelf?
chr: ᎦᏙ ᎠᏛᏁᎭ ᎠᏯᏔᎾᎸ ᎤᎾᎩᎸᏗ?

source: O dear, dear!
chr: Ꭳ ᎤᏲᎢ, ᎤᏲᎢ!

source: Where are our mittens?
chr: ᎭᏢ ᏦᎦᏤᎵ ᏗᎵᏰᏑᎶ?

source: They are not on the table.
chr: ᎥᏝ ᏗᎦᏍᎩᎶᎢ ᏱᎩ.

source: They are not on the chair.
chr: ᎥᏝ ᏗᎦᏍᎩᎶᎢ ᏱᎩ.

source: They are not in the box.
chr: ᎥᏝ ᎧᏁᏌᎢ ᏯᎾᏯᎠ.

source: They are not in the bag.
chr: ᎥᏝ ᏕᎦᎵᏗ ᏯᎾᏯᎠ.

source: They are not on the shelf.
chr: ᎥᏝ ᎠᏯᏔᎾᎸᎢ ᏳᎾᎩᎳ.

source: We cannot find them.
chr: ᏃᏥᏩᏛᎲᎾ ᎨᏎ.

source: The naughty magpie!
chr: Ꮎ ᎤᏲ ᏩᏘᏰᎵ!

source: He knows! ... He knows!
chr: ᎤᏅᏔ! ... ᎤᏅᏔ!

source: Poor little kittens.
chr: ᎤᏂᏲ ᏧᎾᏍᏗ ᏪᏌ ᎠᏂᏓ.

source: They could not find their mittens.
chr: ᏦᎦᏤᎵ ᏗᎵᏰᏑᎶ ᏂᏧᏂᏩᏛᎲᎾ ᎨᏎ.

source: One day they were up in a tree.
chr: ᏅᏩᏓᎴ ᎢᎦ ᏡᎬᎢ ᎤᏂᎸᏎ.

source: The tree was as high as the roof.
chr: ᎦᏌᎾᎵ ᎢᎦᏘ ᎢᏳᏍᏗ ᏡᎬ ᎢᎦᏘ.

source: They saw something on the roof.
chr: ᎪᎱᏍᏗ ᎦᏌᎾᎵᎢ ᎤᏂᎪᎮ.

source: "I see something!" said Mother Cat.
chr: “ᎪᎱᏍᏗ ᏥᎪᏩᏘᎭ!”, ᏄᏪᏎ ᎤᏂᏥ ᏪᏌ.

source: "We see something!" said the kittens.
chr: “ᎪᎱᏍᏗ ᎣᏥᎪᏩᏘᎭ!” ᏄᏂᏪᏎ ᏪᏌ ᎠᏂᏓ.

source: "What is it?" said Mother Oat.
chr: “ᎦᏙ ᎤᏍᏗ?” ᏄᏪᏎ ᎤᏂᏥ ᏪᏌ.

source: "What is it?" said the kittens.
chr: “ᎦᏙ ᎤᏍᏗ?” ᏄᏂᏪᏎ ᏪᏌ ᎠᏂᏓ.

source: "Let us go and see."
chr: “ᎢᏗᎪᎱᎦ.”

source: So the kittens came down from the tree.
chr: ᎠᎴ ᏪᏌ ᎠᏂᏓ ᏡᎬ ᎡᎳᏗ ᎤᏂᎸᏎ.

source: They went up on the roof.
chr: ᎦᏌᎾᎵᎢ ᎦᏚ ᎤᏂᏯᎸᏎ.

source: What do you think was there?
chr: ᎦᏙ ᎤᏍᏗ ᎮᎵᎠ?

source: What do you think they found?
chr: ᎦᏙ ᎤᏍᏗ ᎤᏂᏩᏛᎮ ᎮᎵᎠ?

source: They found their mittens.
chr: ᏧᎾᏤᎵ ᏗᎵᏰᏑᎶ ᏚᏂᏩᏛᎮ.

source: The white silk mittens!
chr: Ꮎ ᏧᏁᎦ ᏏᎵᎩ ᏗᎵᏰᏑᎶ!

source: We have found our mittens.
chr: ᏦᎦᏤᎵ ᏗᎵᏰᏑᎶ ᏚᏂᏩᏛᎲ.

source: O, we have found our mittens.
chr: Ꭳ, ᏦᎦᏤᎵ ᏗᎵᏰᏑᎶ ᏚᏂᏩᏛᎲ.

source: See, we have found our mittens.
chr: Ꮒ! ᏦᎦᏤᎵ ᏗᎵᏰᏑᎶ ᏚᏂᏩᏛᎲ.

source: Purr-rr-rr !
chr: ᏥᏥ-ᏥᏥ-Ꮵ!

source: "Good kittens," said Mother Cat.
chr: “ᎢᏦᏍᏓ ᎢᏥᏪᏌ ᎢᏥᏓ,” ᏄᏪᏎ ᎤᏂᏥ ᏪᏌ.

source: Good little kittens.
chr: ᎠᏃᏍᏓ ᏧᎾᏍᏗ ᏪᏌ ᎠᏂᏓ.

source: Now when the kittens
chr: ᏪᏌᏃ ᎠᏂᏓ

source: Had found their mittens,
chr: ᏧᎾᏤᎵ ᏗᎵᏰᏑᎶ ᏚᏂᏩᏛᎮ,

source: Then they began to cry.
chr: ᎾᎯᏳ ᎠᎾᏠᏱᎮ ᎠᎾᎴᏅᎮ.

source: O, mother dear,
chr: Ꭳ, ᎡᏥ ᎡᏥ,

source: Look here, look here !
chr: Ꮒ! Ꮒ! ᎠᏂ!

source: Our mittens we have found.
chr: ᏦᎦᏤᎵ ᏗᎵᏰᏑᎶ ᏙᎩᏩᏛᎮ.

source: Put on your mittens,
chr: ᏗᏥᏤᎵ ᏗᎵᏰᏑᎶ ᏗᏣᎵᏰᏑᎸᎦ,

source: You good little kittens,
chr: ᏂᎯ ᎢᏦᏍᏓ ᎢᏣᏍᏗ ᎢᏥᏪᏌ ᎢᏥᏓ,

source: And you shall have some pie.
chr: ᎠᎴ ᎨᎵᏍᏘᎩ ᏓᏥᎯ.

source: The kittens went up stairs.
chr: ᏪᏌ ᎠᏂᏓ ᎠᎩᏠᏒᏍᏗᎢ ᎦᎸᎳᏗ ᎤᏁᏅᏎ.

source: The kittens put on their mittens.
chr: ᏪᏌ ᎠᏂᏓ ᏧᎾᏤᎵ ᏗᎵᏰᏑᎶ ᏚᎾᎵᏰᏑᎳᏁ.

source: Now, we will wash our faces.
chr: ᏃᏊ, ᏙᏓᏲᏣᎬᏍᏉᎢ.

source: Now, we will comb our hair.
chr: ᏃᏊᏃ, ᏙᏓᏲᏣᎵᏔᏬᎢ.

source: Now, we will come down stairs.
chr: ᏃᏊᏃ, ᎠᎩᏠᏒᏍᏗᎢ ᎡᎳᏗ ᏓᏲᏤᏅᏏ.

source: We will have some pie.
chr: ᎨᎵᏍᏘᎩ ᏓᏲᎩᎯ.

source: Now, we will sit at the table.
chr: ᏃᏊ, ᎦᏍᎩᎶᎢ ᏓᏲᏣᎵᎪᏂ.

source: Now, we will sit in our chairs.
chr: ᏃᏊᏃ, ᏦᎦᏤᎵ ᏗᎦᏍᎩᎶᎯ ᏙᏓᏳᏃᏟ.

source: O, here is the pie!
chr: Ꭳ, ᎨᎵᏍᏘᎩ ᎠᏂ!

source: It is a good pie.
chr: ᎨᎵᏍᏘᎩ ᎣᏍᏓ.

source: O, what a good pie!"
chr: Ꭳ, ᎨᎵᏍᏘᎩ ᎣᏏᏊ!

source: The magpie saw the pie, too.
chr: ᏩᏘᏰᎵ ᎨᎵᏍᏘᎩ ᎥᏍᏊ ᎤᎪᎮ.

source: "Give me some pie," he said.
chr: “ᎨᎵᏍᏘᎩ ᎢᏍᎩᎥᏏ,” ᏄᏪᏎ.

source: "O, no," said the kittens.
chr: “Ꭳ, Ꮭ,” ᏄᏂᏪᏎ ᏪᏌ ᎠᏂᏓ.

source: "You are a bad bird.
chr: “ᏣᏲᎢ ᎯᏥᏍᏔ.

source: You stole our mittens.
chr: ᏦᎦᏤᎵ ᏗᎵᏰᏑᎶ ᏕᏣᏃᏍᎩᏒ.

source: You put them on the roof.
chr: ᎦᏌᎾᎵᎢ ᏕᏣᏝᏅ.

source: You saw us hunt for them.
chr: ᏙᎩᏯᎸᏒᎢ ᏣᎪᎲ.

source: You laughed at us.
chr: ᎢᏍᎩᏰᏘᏎᎸ.

source: No, no; you shall have, no pie."
chr: ᎥᏝ, ᎥᏝ; ᎨᎵᏍᏘᎩ ᏂᏣᎲᎾ ᎨᏎᏍᏗ.”
